---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricWireType.BendDiameter
source: html/805dcdf9-46c1-8810-d412-ced312a6247c.htm
---
# Autodesk.Revit.DB.Structure.FabricWireType.BendDiameter Property

Determines the bending diameter of the wire.

## Syntax (C#)
```csharp
public double BendDiameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for bendDiameter is not a number
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The bending diameter bendDiameter is negative.